Repository: PureBasicCN/PureBasicPreference
Catalog: OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: German Pure Basic forum
zh_cn: 中文 Pure BASIC 论坛

source: German translator :
zh_cn: 帮助文档翻译:

source: Getting Started
zh_cn: 入门指南

source: Here all the source codes are displayed.
zh_cn: 这里显示了所有的源代码。

source: Here are some links about SQL syntax:
zh_cn: 以下是一些有关 SQL 语法的链接︰

source: Here you can change all the settings that control the look & behavior of the IDE.
zh_cn: 在这里你可以更改IDE所有设置来控制外观与行为。

source: Here you can see a list of the last accessed files.
zh_cn: 在这里你可以看到最后被访问的文件的列表。

source: Here you can set an icon that will be displayed when viewing the created executable in the explorer.
zh_cn: 在这里您可以设置一个在浏览器中可以查看的创建的可执行文件的图标。

source: Here you have several tools to make coding easier and increase productivity.
zh_cn: 在这里，你有几个工具可以使编码更容易并且提高生产效率。

source: Holding down the Shift key and using the arrow keys selects text.
zh_cn: 按住 Shift 键与鼠标配合可以用来选择文本。

source: Home
zh_cn: 首页

source: However in some cases, double-clicking has a special meaning:
zh_cn: 然而在某些情况下，双击有特殊的意义：

source: However when one or more full lines are selected, the reaction is different.
zh_cn: 当选中一行或者多行代码时，

source: However, once a program consists of a number of source code and maybe other related files, it can be simpler to handle them all in one project.
zh_cn: 然而，一旦一个程序由若干源代码和其他相关文件时（如一系列的代码文件等），使用此功能便可以简单的将它们在同一个项目中进行管理。

source: However, they provide the possibility to place custom fold points that do not correspond to a specific PB keyword.
zh_cn: 然而，它们提供了一个自定义折叠区间的功能，却不用自定义折叠关键字。

source: If #PB_All is specified, all the remaining serial ports are freed.
zh_cn: 如果参数 #PB_All 被指定, 所有剩余的串行端口都被释放.

source: If #PB_Any was used for the #SerialPort parameter then the generated number is returned on success.
zh_cn: 如果使用#PB_Any为 #SerialPort 参数，返回一个生成的数。

source: If #PB_Any was used for the #Window parameter then the generated number is returned on success.
zh_cn: 如果#PB_Any被用于#Window参数在成功时则返回生成数字。

source: If Result is 0, it has failed and all further call to console functions must be disabled.
zh_cn: 如果result 为0，表示已经失败并且必须禁止所有进一步调用到的控制台函数。

source: If a matching brace could not be found (which is a syntax error in PureBasic) the IDE will highlight the current brace in red.
zh_cn: 若未找到匹配的括号（可能是 PureBasic 中的语法错误）IDE 将对此高亮提示。

source: If a read error has occured, it will return zero.
zh_cn: 如果出现读取错误，它将返回零。

source: If a type is specified for a variable after Global, the default type is changed through the use of this declaration.
zh_cn: 如果在Global之后为变量指定了类型，通过这一声明更改默认类型。

source: If any text is selected before this, it will be removed and replaced with the content of the Clipboard.
zh_cn: 如果执行粘贴操作时有文本内容被选中，选中内容将会被删除并用剪贴板的内容替换。

source: If it was the only open code, the IDE will display a new empty file.
zh_cn: 如果它是唯一打开的源码，开发环境将会显示一个新的空白文件。

source: If no '.app' is set, then it will create a regular console-like executable.
zh_cn: 如果设置不是'.app'，那么会创建一个常规控制台的可执行文件。

source: If special keys (non-ASCII) have to be handled, RawKey() should be called after Inkey().
zh_cn: 如果特殊键（非ASCII）已进行处理， RawKey()应在Inkey()之后调用。

source: If such a function is used in the code, the compiler will issue a warning.
zh_cn: 如果这些旧版功能函数在代码中使用，编译器会发出警告。

source: If the compiler version matches that of the default compiler but the target processor is different then the built-in debugger of the IDE can still be used to debug the compiled executable.
zh_cn: 如果编译器版本与默认编译器相匹配，但目标处理器是不同的则IDE的内置调试器仍然可以用于调试编译的可执行文件。

source: If the cursor is currently on a keyword such as "If" this menu option jumps directly to the keyword that matches it (in this case "EndIf").
zh_cn: 当光标指针指向一个关键字时，这个菜单选项会使光标直接跳到与其匹配的关键字上。（如光标指向“If”时，会跳转到“endif”）

source: If the cursor is on a Keyword such as "If", the IDE will underline this keyword and all keywords that belong to it such as "Else" or "EndIf".
zh_cn: 如果光标位于关键字，如 "If"，IDE 将强调此关键字，如 "Else" 或 "EndIf" 属于它的所有关键字。

source: If the executable format is set to DLL, it will create a DLL on Windows, shared object on Linux and dylib on OS X. When creating an executable on OS X, appending '.app' at the executable name will create a bundled executable with the necessary directory structure, including the icon.
zh_cn: 如果可执行文件格式设置为DLL，它将会在Windows中创建DLL，在Linux创建shared object（共享对象），在OS X上创建dylib。在创建'.app' 的应用程序时将捆绑执行时必要的目录结构，包括图标。

source: If the file isn't saved yet, you will be prompted for a filename.
zh_cn: 如果文件从未保存，将提示您输入文件名。

source: If the input buffer was empty, this function will block until data is available.
zh_cn: 如果输入的缓冲区是空的，此函数将阻塞直到有可用数据。

source: If the input string did not match the mask then the result is -1.
zh_cn: 如果输入的字符串与掩码不匹配，则结果为 -1.

source: If the version does not match then the standalone debugger that comes with the selected compiler will be used for debugging to avoid version conflicts.
zh_cn: 如果版本不匹配，则将使用选定的编译器的独立调试器进行调试，以避免版本冲突。

source: If there is a mismatch in the keywords it will be underlined in red.
zh_cn: 如果有不匹配的关键字将以红色加下划线进行标注提醒。

source: If there is no marker after the cursor position, it jumps to the first on in the source code.
zh_cn: 如果光标位置之后没有书签标记，将跳转到代码中的第一个书签处。

source: If these parameters are not specified then the image will be drawn in its original size.
zh_cn: 如果不指定这些参数绘制图像则会使用其原始尺寸

source: If these parameters are not specified, then the current system date and time are used.
zh_cn: 如果没有指定这些参数，则使用当前的系统日期和时间.

source: If this flag is set then the background will be transparent with the DrawText() command.
zh_cn: 如果设置了此标志DrawText()函数输出的背景将透明

source: If this parameter is not specified, the default color set with FrontColor() will be used.
zh_cn: 如果未指定此参数，将使用与FrontColor()设置的默认颜色。

source: If your program is intended to be a pure console application (i.e. not a GUI application which sometimes opens a console) then you must remember to set the executable format to 'Console' when you are compiling your programs.
zh_cn: 如果你的程序的目的是成为一个纯粹的控制台应用程序（即不是有时打开一个控制台的GUI应用程序），那么你一定要记得当你编译你的程序时设置可执行格式为“控制台”

source: Import/Export
zh_cn: 导入/导出

source: In PureBasic, a recurrence is fully supported for the procedures and any procedure can call it itself.
zh_cn: 在 PureBasic中，递归调用是完全受支持的，任何程序都可以自己调用自己。

source: In buying PureBasic you will ensure that development will go further and faster.
zh_cn: 使用购买的PureBasic您将确保开发将走的更远，更快。

source: In case of an error that prevents the compiler from completing the compilation, it aborts and displays an error-message.
zh_cn: 在编译时产生一个错误阻止程序继续编译的情况下，编译将中止并显示错误消息。

source: In order to use local variables within a procedure, which have the same name as global variables, take a look at the Protected and Static keywords.
zh_cn: 针对过程内部使用的局部变量, 有和全局变量名称相同的，请查看Protected和Static关键字。

source: In spite of its beginner-friendly syntax, the possibilities are endless with PureBasic's advanced features such as pointers, structures, procedures, dynamically linked lists and much more.
zh_cn: 尽管它的语法很适合初学者，但是对于PureBasic的高级特性是不受限制的，比如指针， 结构，过程，动态链接表和其它..

source: In that case at the beginning of each selected line, it will insert spaces or a tab (depending on the configuration).
zh_cn: 在每一行的前面都将会插入空格符或者 tab 制表符。

source: In the same way, if you double-click on an IncludeBinary statement, the IDE will try to display that file in the internal file viewer.
zh_cn: 同样，当你鼠标双击二进制文件引用 IncludeBinary 语句时，开发环境 IDE 将尝试使用内部文件查看器打开该文件。

source: In this "plain text" mode, code-related features such as coloring, case correction, auto complete are disabled.
zh_cn: 在"纯文本"模式下，相关代码的特新比如着色、 大小写转换，自动完成代码会被禁用。

source: In this area, the compiler errors and debugger messages are logged.
zh_cn: 在此区域显示编译器错误和调试消息的日志。

source: In this case the command Global must be called for the according variables, before the declaration of the procedure.
zh_cn: 在这种情况下 Global 命令必须在定义过程 之前 将相关变量定义为全局。

source: In this submenu you can select the text encoding as well as the newline format which should be used when the currently active source code is saved to disk.
zh_cn: 在这个子菜单中，你可以选择用于当前激活的源码保存到磁盘中时的文本编码格式和换行符制式。

source: Indentation/Alignment of comments:
zh_cn: 注释的缩进/对齐：

source: Indentation:
zh_cn: 缩进：

source: Insert the content of the Clipboard at the current position in the code.
zh_cn: 将剪贴板中的内容，插入到代码的当前位置。

source: Inserts a comment (";") before every line of the selected code block.
zh_cn: 在所选择的代码块的每一个前行插入一个注释符（“;”）。

source: Internet TV
zh_cn: 网络 TV

source: Introduction
zh_cn: 介绍

source: Is PureBasic really small and fast ?
zh_cn: PureBasic真的小巧并且速度很快？

source: Is it allowed to use DLLs made with PureBasic in other projects ?
zh_cn: 难道是允许使用在其他项目的PureBasic制成的DLL？

source: Is the PureBasic licence valid for all OS ?
zh_cn: PureBasic的许可在所有操作系统都有效？

source: It also causes the compiler to reload all the libraries and resident files, and with that, the list of known PureBasic functions, Structures, Interfaces and Constants is updated too.
zh_cn: 它还会使编译器重新加载所有的库和 resident 文件，并且还有已知的PureBasic功能函数命令，更新过的结构，接口和常量列表等。

source: It also closes if you click with the mouse anywhere within the IDE.
zh_cn: 在IDE中的任意位置单击鼠标同样可以关闭自动完成列表。

source: It can be a combination of the following flags:
zh_cn: 它可以是下列标志的组合：

source: It can be fully customized.
zh_cn: 它可以完全自定义。

source: It can be less than the requested length.
zh_cn: 它可以小于请求的长度。

source: It can be one of the following constants:
zh_cn: 它可以是下列常量之一:

source: It can be one of the following value:
zh_cn: 它可以是以下值之一︰

source: It can be one of the following values:
zh_cn: 它可以是下列值之一︰

source: It doesn&apos;t interrupt (halt) the program flow.
zh_cn: 它不中断（停止）程序流程。

source: It has been continually updated since.
zh_cn: 它一直在不断地更新。

source: It has no effect on other OS.
zh_cn: 它在其他操作系统中没有效果。

source: It has to be declared like this:
zh_cn: 它可以这样声明︰

source: It instead inserts two spaces.
zh_cn: tab 制表符将被插入的2个空格符所替代。

source: It is also displayed in the title bar of your programs windows and the Taskbar.
zh_cn: 它正在你的程序窗口的标题栏和任务栏显示。

source: It is blended on to 'Color2'.
zh_cn: 它被混合到“Color2”。

source: It is especially useful for library developers to test their library.
zh_cn: 这对Lib库开发者测试他们的Lib库是特别有用的。

source: It must have the following form:
zh_cn: 必须要具备以下形式：

source: It removes spaces/tabs at the start of each line in order to reduce the indentation of the whole block.
zh_cn: 它将每一行前面的空格或制表符去除，来达到使整个选中块减少缩进。

source: It shouldn't replace any larger tutorial or the massive information, which can be found on the popular PureBasic forums.
zh_cn: 本指南并不是完整的教程，有关PureBasic大量的信息，可以在PureBasic论坛中找到。

source: It shows the corresponding menu command.
zh_cn: 它显示相应的菜单命令。

source: It will use the PureBasic VectorDrawing library and can only be used within a StartVectorDrawing() / StopVectorDrawing() block.
zh_cn: 它将使用 PureBasic VectorDrawing 库，并且只能使用在StartVectorDrawing() / StopVectorDrawing()之间的块中使用。

source: It's complementary to have finer change trace.
zh_cn: 它是互补有更细的更改跟踪。

source: It's like source backup tool, limited in time (by default one month of recording).
zh_cn: 这就像源码备份工具，但限制了时间 （默认情况下是一个月的记录）。

source: It's not aimed to replace a real source code version control system like SVN or GIT.
zh_cn: 它的目的不是要取代像 SVN 或 GIT这样真正的源代码版本控制系统。

source: Just select "Compile/Run" (F5 by default) and your program will be compiled and executed for a testing run.
zh_cn: 只要在菜单中选择“编译/运行”（快捷键默认为F5），你的程序将会被编译并进行一次测试运行。

source: Learning PureBasic is very easy!
zh_cn: 学习 PureBasic 非常的 容易!

source: Links
zh_cn: 链接

source: MacOS X: The icon must be in ICNS format (Macintosh Icon).
zh_cn: MacOS X: 图标必须是ICNS格式（Macintosh 图标）。

source: Main coder :
zh_cn: 语言包翻译、文档翻译

source: Managing projects
zh_cn: 管理工程

source: Many tools to make navigating/editing the source code easier can be added to the Tools Panel on the side of the editor window.
zh_cn: 许多工具有助于浏览、编辑源代码等，可以添加到工具面板上的编辑器窗口的一侧。

source: Markers act like Bookmarks in the source code.
zh_cn: 在源代码中的标志就像书签。

source: Marking of matching Braces and Keywords:
zh_cn: 标记括号和关键字:

source: Marking several lines of text and pressing Shift+Tab reverses this behavior.
zh_cn: 按下 Shift+Tab 时会将选中的多行文本进行反缩进动作。

source: MessageRequester
zh_cn: 对话框输出

source: Microsoft Windows API support
zh_cn: Microsoft Windows API 支持

source: Mode
zh_cn: 模式

source: Mode (optional)
zh_cn: 模式 （可选）

source: Money-transfer to bank-account is possible at german team member
zh_cn: 汇款银行账户有可能在德国团队

source: More can be added), the IDE marks the region between these keywords on the left side next to the line numbers with a [-] at the starting point, followed by a vertical line to the end point.
zh_cn: 他可以添加），开发环境 IDE 将在这些关键字的开头和结尾左侧用[ - ]标志，随后用垂直线标记开头到结尾之间的区域。

source: More file extensions can be recognized as code files by configuring their extension in the "Editor" section of the Preferences.
zh_cn: 更多的文件扩展名可以被视为代码文件通过的首选项中的"编辑器"配置其扩展名。

source: More information can be found at StartDrawing().
zh_cn: 详情请参考 StartDrawing().

source: Most of the compiler settings will be taken from the main source file, so when setting this, they are disabled.
zh_cn: 大多数的编译器设置将从主源文件中取出，所以在设置这个程序时，他们是禁用的。

source: Moves the cursor to the given position, in character coordinates.
zh_cn: 使用字符坐标移动光标到指定的位置。

source: News
zh_cn: 新闻

source: No.
zh_cn: 否.

source: None.
zh_cn: 无.

source: Nonzero if the serial port is valid, zero otherwise.
zh_cn: 如果串行端口是有效的为非零，否则为零。

source: Nonzero if the serial port was successfully opened, zero otherwise (it may be already in use, or the parameters are wrong).
zh_cn: 如果串行端口已成功打开，返回值为非零，否则零 （它可能已经在使用中，或参数错误）。

source: Nonzero if the window was successfully created, zero otherwise.
zh_cn: 非零为窗口创建成功，否则为零！.

source: Normally we would present here the typical "Hello World".
zh_cn: 我们来个典型的 "Hello World" 吧.

source: Not if you just move up/down a few lines with the cursor keys.
zh_cn: 而不是记录像上下左右键这样的小动作。

source: Note that many of the Edit menu items are also accessible by right clicking on the source code, which opens a popup menu.
zh_cn: 请注意，许多编辑菜单项是在源代码处通过点击鼠标右键来访问。

source: Note that such compatibility wrappers will not remain indefinitely but will be removed in a future update, so it is recommended to fix issues that cause a compiler warning instead of relying on such deprecated functions.
zh_cn: 请注意，这种兼容不会无限期地保持，软件会在以后的更新中移除这些旧函数，因此建议更新并修复导致编译器警告的代码，而不是依赖于软件过渡过程中对旧函数的兼容。

source: Note that this only records greater jumps in the code.
zh_cn: 请注意，这里只记录大位置跳跃信息，

source: Note: Even though the state of these folded code lines is remembered when you save/reopen the file, the actual created code file always contains all lines.
zh_cn: 注意：尽管这些代码以折叠状态保存且当你打开文件也会保持折叠状态，却依然是包含所有代码行。

source: Note: The #PB_2DDrawing_CustomFilter drawing mode only works on ImageOutput() and CanvasOutput().
zh_cn: 注意： ＃PB_2DDrawing_CustomFilter绘图模式仅适用于ImageOutput()和CanvasOutput()。

source: Note: The drawing process starts after calling StartDrawing() and must end with StopDrawing().
zh_cn: 注意：绘制过程必须在调用 StartDrawing() 开始并以调用 StopDrawing()结束.

source: Note: This command only has an effect with ImageOutput() and CanvasOutput().
zh_cn: 注：此命令只能与ImageOutput（）和CanvasOutput（）一起使用才有效果。。

source: Note: This function can be called only once for each column.
zh_cn: 注意︰ 每列此函数可以是只调用一次。

source: Note: This mode does not work with PrinterOutput().
zh_cn: 注： 这种模式不能与PrinterOutput()同时工作。

source: Note: Under Windows, prior to using an ODBC database, it is necessary to establish an ODBC "User Data Source" which makes your database available via ODBC and useable with this Database library.
zh_cn: 注意: 在 Windows 中使用 ODBC 数据库，, 就必须建立 ODBC"用户数据源"，因此你的数据库源 ODBC必须有效 并且此数据库必须可用。

source: Note: When using this option, you MUST save your source before compiling, as only files that are written to disk will be used in this case.
zh_cn: 注意：使用此选项时，您必须编译之前保存源代码，因为只有写入到磁盘文件才会被主源文件所包含引用。

source: Note: You can also set/remove markers by holding down the Ctrl Key and clicking on the border that holds the markers (not the Line-number part of it).
zh_cn: 注意:你也可以通过按住Ctrl键点击行号后面的空白位置来添加或移除书签标记。

source: Note: You can configure what is displayed in the Auto complete list, as well as turning off the automatic popup (requiring a keyboard shortcut such as Ctrl+Space to open list) in the Preferences.
zh_cn: 注意：您可以在配置中设置自动完整列表的显示内容以及关闭快捷键（如：快捷键 Ctrl +空格键打开列表）。

source: Note: any user can develop their own libraries.
zh_cn: 注意:任何用户可以开发他们自己的库.

source: Note: supported date/time values are 1970-01-01, 00:00:00 for the minimum and 2038-01-19, 03:14:07 for the maximum.
zh_cn: 注意: 支持的日期/时间最小值为1970-01-01, 00:00:00 ，最大值为 2038-01-19, 03:14:07.

source: Note: when #PB_Date_Month is used, it will automatically account for the fact that the numbers of days per month varies, for example: if a month is added to '31 march 2008' the result will be '30 april 2008', since april does not have 31 days.
zh_cn: 注意: 当值类型使用 #PB_Date_Month 时, 程序将自动根据每个月的实际天数来计算添加值, 例如: 2008年03月31日加 1 个月之后结果是2008年04月30日， 因为4月份没有31天.

source: Official Pure Basic forum
zh_cn: 官方 Pure BASIC 论坛

source: Official PureBasic blog
zh_cn: 官方PureBasic博客

source: Offline Ordering
zh_cn: 在线购买

source: Offline ordering
zh_cn: 离线购买

source: Ok here we go with two examples:
zh_cn: Ok，看下面两个例子：

source: On Microsoft Windows, there are two different executable formats: Win32 and Console.
zh_cn: 在Microsoft Windows中，有两种不同的可执行文件格式：Win32和控制台。

source: On Windows, specifying a title allow the saving of custom console parameter, like font, color etc.
zh_cn: 在Windows中，指定一个标题允许自定义控制台参数的节能，如字体，颜色等。

source: Once the console has been closed, it's not possible to use any console-related functions unless you open the console again.
zh_cn: 当年你关闭控制台后，将不能使用任何与控制台有关的函数，除非你再次打开。

source: Once you get PureBasic, you can do any kind of program (freeware, shareware and even commercial applications) without have to pay any extra costs to Fantaisie Software.
zh_cn: 一旦你拥有PureBasic，你可以做任何一种程序（免费软件，共享软件，甚至商业应用），而不需要支付任何额外费用到 Fantaisie Software。

source: Online Ordering
zh_cn: 在线购买

source: Only one console can be opened at the same time in a PureBasic program.
zh_cn: 只有一个控制台可以在一个的PureBasic程序同时被打开。

source: Only some settings like the debugger setting will be used from the current source.
zh_cn: 当前源文件调试器设置只有少部分设置被使用。

source: Open a console window.
zh_cn: 打开一个控制台窗口。

source: Open an existing source code file for editing.
zh_cn: 打开现有的源代码文件进行编辑。

source: Opens a new window according to the specified parameters.
zh_cn: 根据指定的参数打开一个新窗口。

source: Opens a serial port for use.
zh_cn: 打开串口以备使用.

source: Options for building projects:
zh_cn: 项目生成选项:

source: Options for launching the IDE:
zh_cn: 用于启动IDE选项：

source: Or to quickly see the whole code again when some of the code is folded.
zh_cn: 或快速查看有多处折叠项的完整代码时。

source: Ordering
zh_cn: 订购

source: Other then that, there is the main menu and the toolbar.
zh_cn: 其他的在主菜单和工具栏。

source: Otherwise the code will be saved in the file it was saved in before.
zh_cn: 否则代码将会被保存到之前已经保存的文件中。

source: Outside of a procedure A will exist at Main scope, within a procedure it will become local.
zh_cn: 在 过程 之外的 A 属于外部变量，过程之内的 A 属于局部变量.

source: Overview
zh_cn: 概要

source: Parameters
zh_cn: 参数

source: Possible tokens are:
zh_cn: 格式如下:

source: Procedure Support
zh_cn: 过程支持

source: Programs can be created and compiled without making use of the project management.
zh_cn: 虽说不利用项目管理功能两样也可以创建、编译程序。

source: Project management overview
zh_cn: 项目工程概述

source: Pure Basic : Download
zh_cn: Pure Basic : 下载

source: Pure Basic : Introduction
zh_cn: Pure Basic : 介绍

source: Pure Basic : Links
zh_cn: Pure Basic : 链接

source: Pure Basic : News
zh_cn: Pure Basic : 新闻

source: Pure Basic : Ordering !
zh_cn: Pure Basic : 订购 !

source: Pure Basic : Screenshots
zh_cn: Pure Basic : 截图

source: Pure Basic : Support
zh_cn: Pure Basic : 支持

source: Pure Basic : optimized basic compiler
zh_cn: Pure Basic : 已优化的BASIC编译器

source: Pure Basic : support
zh_cn: Pure Basic : 中文支持

source: Pure Basic Reference Manual
zh_cn: Pure Basic 参考手册

source: Pure Basic compiler : users opinions
zh_cn: Pure Basic 编译器︰ 用户意见

source: Pure Basic compiler news
zh_cn: Pure BASIC 编译器新闻

source: Pure Basic documentation
zh_cn: Pure BASIC 在线文档

source: Pure Basic forums
zh_cn: Pure BASIC 中文社区

source: Pure Basic support site
zh_cn: Pure BASIC 支持网站

source: PureBasic - Feel The Pure Power.
zh_cn: PureBasic - 体验纯粹的强大.

source: PureBasic : Native compiler, easy & optimized BASIC programming language
zh_cn: PureBasic︰ 本机编译器，简单且已优化的BASIC 编程语言

source: PureBasic Documentation
zh_cn: PureBasic中文 在线文档

source: PureBasic License type
zh_cn: PureBasic 许可类型

source: PureBasic Team Blog
zh_cn: PureBasic团队博客

source: PureBasic Team Blog | random thoughts on PureBasic development
zh_cn: PureBasic 团队博客 | PureBasic 开发随感

source: PureBasic Team Blog » Comments Feed
zh_cn: PureBasic团队博客»评论Feed

source: PureBasic Team Blog » Feed
zh_cn: PureBasic 团队博客 » Feed

source: PureBasic documentation in PDF format (full version)
zh_cn: PureBasic PDF 英文格式文档

source: PureBasic documentation in PDF format (without libraries commands)
zh_cn: PureBasic PDF格式，不带库指令的版本

source: PureBasic is a native 32-bit and 64-bit programming language based on established BASIC rules.
zh_cn: PureBasic 是基于既定的BASIC规则本机 32 位和 64 位编程语言。

source: PureBasic is a portable programming language which currently run on AmigaOS (680x0 and PowerPC) Windows (x86 and x64), Linux (x86 and x64) and MacOS X (x86 and PowerPC).
zh_cn: PureBasic是一个能够在 AmigaOS（680X0和PowerPC），Windows（x86和x64），Linux操作系统（x86和x64）和MacOS X（x86和PowerPC）上可便携式的编程语言。

source: PureBasic is a programming language based on established BASIC rules
zh_cn: PureBasic 是一个基于BASIC规定的编程语言

source: PureBasic is designed for both beginners and 'pure' advanced users alike.
zh_cn: PureBasic 针对初学者和'pure' 高级用户并受到他们的好评.

source: PureBasic online documentation
zh_cn: PureBasic 在线文档

source: PureBasic provides full access to them.
zh_cn: PureBasic提供了针对他们的完整访问.

source: Purebasic user account
zh_cn: PureBasic 用户账号

source: RIT stands for 'ReadIntervalTimeout'.
zh_cn: RIT 表示'ReadIntervalTimeout"，两字符之间最大的延时，当读取串口数据时，一旦两个字符传输的时间差超过该时间，读取函数将返回现有的数据.

source: RTTC stands for 'ReadTotalTimeoutConstant'.
zh_cn: RTTC 表示 'ReadTotalTimeoutConstant'，一次读取串口数据的固定超时。所以在一次读取串口的操作中，其超时为ReadTotalTimeoutMultiplier乘以读取的字节数再加上 ReadTotalTimeoutConstant。将ReadIntervalTimeout设置为MAXDWORD，并将ReadTotalTimeoutMultiplier 和ReadTotalTimeoutConstant设置为0，表示读取操作将立即返回存放在输入缓冲区的字符。可以理解为一个修正时间，实际上就是按ReadTotalTimeoutMultiplier计算出的超时时间再加上该时间才作为整个超时时间。 .

source: RTTM stands for 'ReadTotalTimeoutMultiplier'.
zh_cn: RTTM 表示 'ReadTotalTimeoutMultiplier'，指定比例因子（毫秒），实际上是设置读取一个字节和等待下一个字节所需的时间，这样总的超时时间为读取的字节数乘以该值，同样一次读取操作到达这个时间后，也认为本次读操作己经结束。。

source: Reads an arbitrary amount of data from the #SerialPort.
zh_cn: 从 #SerialPort 中读取任意数量的数据。

source: Redo the last action undone by the undo function.
zh_cn: 重新执行被撤消功能撤消的最后一个动作。

source: Reference Manual - Index
zh_cn: 参考手册 - 索引

source: Reformats the indentation of the selected lines to align with the code above them and to reflect the keywords that they contain.
zh_cn: 重新根据 关键字 keywords 及代码结构对选中行进行自动缩进操作。

source: Reloads the currently active source code from disk.
zh_cn: 重新从磁盘载入当前活动源码。.

source: Remarks
zh_cn: 备注

source: Removes the comment characters at the beginning of each selected line.
zh_cn: 将选定行的开头的注释符删掉。

source: Repeated usage of the shortcut selects further surrounding code blocks.
zh_cn: 继续按下快捷键会进一步扩大选择代码块的范围。

source: Return value
zh_cn: 返回值

source: Returns a character string if a key is pressed during the call of Inkey().
zh_cn: 如果调用Inkey()期间按下键返回一个字符串.

source: Returns a number between 0 and 6 representing the day of the week:
zh_cn: 返回一个介于 0 到 6 之间的数字，代表一周中的某一天:

source: Returns a string containing the pressed character if it is a non-special key, and an empty string otherwise.
zh_cn: 返回包含按压字符的字符串，如果它是一个非专用键，以及一个空字符串，否则。

source: Returns a string representation of the given Date.
zh_cn: 返回给定日期，以字符串形式表示.

source: Returns the ID for this database connection.
zh_cn: 返回此数据库连接的 ID。

source: Returns the ID of the serial port.
zh_cn: 返回串行端口的ID。
